Repository: marcosjunqueira/sonar-l10n-pt-omegat
Catalog: tm/javacvs-omegat.tmx
Source language: en_us
Languages: pt_br

source: Connection method to use when connecting to this CVS server
pt_br: Método de conexão utilizado ao tentar conectar ao servidor CVS

source: Your username
pt_br: Seu nome de usuário

source: Host name of the CVS server.
pt_br: Nome da máquina do servidor CVS.

source: In case of connection via SSH, host name of the SSH server.
pt_br: No caso de conexões via SSH, nome da máquina do servidor de SSH.

source: TCP/IP port number of the CVS server.
pt_br: Número da porta TCP/IP do servidor CVS.

source: In case of connection via SSH, port number of the SSH server.
pt_br: No caso de conexões SSH, número da porta do servidor SSH.

source: Leave blank for default port.
pt_br: Deixar em branco para porta padrão.

source: Path to CVS repository to connect to
pt_br: Camiho do repositório CVS a ser conectado

source: Can not create folder:
pt_br: Impossível criar a pasta:

source: Local working directory must be specified.
pt_br: Diretório de trabalho local deve ser especificado.

source: Can not write into:
pt_br: Impossível escrever em:

source: Path points to file but directory is expected
pt_br: O caminho aponta para um arquivo, mas é esperado um diretório

source: Lets you browse for local destination folder for checked out files.
pt_br: Permite navegar pela pasta de destino dos arquivos obtidos.

source: In this panel you specify the CVS root of your repository and any parameters needed for making connection to it.
pt_br: Neste painel deve ser especificado a raiz do CVS do repositório, bem como todo e qualquer paramêtro necessário para que a conexão seja realizada.

source: Test connection failed, suggesting to setup a proxy.
pt_br: Conexão de teste falhou, lembre-se de configurar o proxy.

source: Can not write password file.
pt_br: Não foi possível escrever no arquivo de senhas.

source: Unfortunately further actions need to read from it.
pt_br: Infelizmente ações futuras necessitarão ler a partir deste.

source: Invalid CVS Root:
pt_br: Raiz CVS inválida:

source: Stop
pt_br: Parar

source: Verification stopped by user!
pt_br: Verificação parada pelo usuário!

source: Edit CVS root string field by field
pt_br: Editar a string da raiz do CVS campo a campo

source: Edit connection parameters and proxy settings for connection to this CVS server
pt_br: Editar os parâmetros de conexão e proxy para a conexão com o servidor CVS

source: Your SSH password will be stored on disk so you won't have to enter it the next time you connect.
pt_br: A senha SSH será gravada no disco para que não seja necessário informa-la durante a próxima conexão.

source: Your SSH password
pt_br: Sua senha SSH

source: Use external program or command to establish connection to this CVS server
pt_br: Utilizar um programa externo ou comando para estabelecer uma conexão com este servidor CVS

source: User built-in implementation of SSH to establish connection to this CVS server
pt_br: Utilizar a implementação interna para estabelecer uma conexão SSH com este servidor CVS

source: External command to execute which will provide connection to this CVS server.
pt_br: Comando externo o qual proverá conexão com este servidor CVS.

source: Your CVS password used for pserver authentication.
pt_br: Senha do CVS utilizada para autenticação pserver.

source: Netbeans uses system proxy "{0}" that cannot be changed here.
pt_br: O Netbeans utiliza o proxy do sistema "{0}" o qual não pode ser alterado aqui.

source: You have to unset it from your system environment first.
pt_br: É necessário remover a variável de ambiente primeiro.

source: Unable to configure proxy
pt_br: Impossível configurar o proxy

source: Browse for modules to check out in the list of all modules in the repository
pt_br: Procura pelos módulos a serem obtidos na lista completa de módulos do repositório

source: Browse for specific branch to check out in the list of all branches in the repository
pt_br: Procura por um branch específico a ser obtidos na lista completa de branches do repositório

source: Browse for local folder to check out into
pt_br: Procura por uma pasta local onde serão copiados os arquivos obtidos

source: Name of the branch to check out.
pt_br: Nome do branch a ser obtido.

source: Leave blank for default branch (trunk).
pt_br: Deixar em branco para branch padrão (trunk).

source: List of modules to check out separated by semicolons (;).
pt_br: Lista de módulos a serem obtidos, separados por ponto e vírgula (;).

source: Leave blank to check out all modules.
pt_br: Deixar em branco para obter todos os módulos.

source: Local folder to check out selected modules into
pt_br: Pasta local onde serão copiados os arquivos obtidos

source: Lets you pick modules to check out, specify a branch to check out and destination local folder for checked out files.
pt_br: Permite escolha de módulos, especificar um branch bem como a local de destino, dos arquivos obtidos.

source: Edit CVS Root
pt_br: Editar raiz do CVS

source: Lets you edit CVS root string field by field, specifying connection method, username, password, CVS host and path to repository.
pt_br: Permite editar a string da raiz do CVS campo a campo, especificando o método de conexão, usuário, senha, o servidor CVS bem como o caminho do repositório.

source: Browse for external executable
pt_br: Procurar um executável externo

source: Browse For External Executable
pt_br: Procura por um executável externo

source: Shows CVS status of selected files
pt_br: Exibe a situação do CVS dos arquivos selecionados

source: unknown age
pt_br: idade desconhecida

source: current
pt_br: atual

source: 1 second ago
pt_br: 1 segundo atrás

source: {0} seconds ago
pt_br: {0} segundos atrás

source: 1 minute ago
pt_br: 1 minuto atrás

source: {0} minutes ago
pt_br: {0} minutos atrás

source: 1 hour ago
pt_br: 1 hora atrás

source: {0} hours ago
pt_br: {0} horas atrás

source: 1 day ago
pt_br: 1 dia atrás

source: {0} days ago
pt_br: {0} dias atrás

source: List of modified files
pt_br: Lista de arquivos modificados

source: Lists all files that are not in sync with repository
pt_br: Lista todos os arquivos que não estejam sincronizados com o repositório

source: Sticky Tag
pt_br: Marcação fixa

source: Sticky Branch, Tag or Date
pt_br: Branch fixo, marcação ou data

source: Versioning status of the file
pt_br: Situação de versionamento do arquivo

source: File location in repository
pt_br: Localização do arquivo no repositório

source: "{0}" branch
pt_br: Branch "{0}"

source: multiple branches
pt_br: múltiplos branches

source: Added
pt_br: Adicionado

source: New In Repository
pt_br: Novo no repositório

source: Modified In Repository
pt_br: Modificado no repositório

source: Excluded
pt_br: Excluído

source: Open
pt_br: Abrir

source: All
pt_br: Todos

source: <No Local Changes>
pt_br: <Sem alterações locais>

source: <No Remote Changes>
pt_br: <Sem alterações remotas>

source: <No Local/Remote Changes>
pt_br: <Sem alterações locais/remotas>

source: Diff All
pt_br: Comparar todos

source: Update All
pt_br: Atualizar todos

source: Commit All
pt_br: Submeter todos

source: Refresh Status
pt_br: Atualizar status

source: Show local changes
pt_br: Exibe as alterações locais

source: Show repository changes
pt_br: Exibe as alterações no repositório

source: Show all changes
pt_br: Exibe todas as alterações

source: Refreshing Versioning view
pt_br: Atualizando visualização de versionamento

source: Sticky
pt_br: Fixo

source: Sticky Branch, Tag or Revision
pt_br: Branch fixo, marcação ou revisão

source: Path
pt_br: Caminho

source: File name
pt_br: Nome do arquivo

source: Pure file name without path
pt_br: Apenas nome do arquivo, sem o caminho

source: Last known CVS status
pt_br: Última situação do CVS conhecida

source: CVS Options
pt_br: Opções do CVS

source: Add Variable
pt_br: Adicionar variável

source: &Status Label Format Variables:
pt_br: Variáveis de formatação do rótulo de &situação:

source: {status} - CVS status of the file (Modified, New, etc...)
pt_br: {situação} - Situação CVS do arquivo (Modificado, Novo, etc...)

source: {tag} - Sticky tag information: branch name, tag name, or date
pt_br: {marcação} - Colar informação da marcação: nome do branch, nome da marcação, ou data

source: {binary} - Binary flag: -kb CVS keyword substitution
pt_br: {binário} - Marca binária: -kb substituição de palavra-chave CVS

source: {revision} - CVS revision number (1.2, 1.5.2.2, etc.)
pt_br: {revisão} - número da revisão CVS (1.2, 1.5.2.2, etc.)

source: &Status Label Format:
pt_br: Formatação do rótulo da &situação:

source: A&dd Variable...
pt_br: A&dicionar variável

source: Apply "&Exclude From Commit" On New Files Automatically
pt_br: Aplicar "&Excluir da submissão" em novos arquivos automaticamente

source: &Wrap Commit Messages To (characters):
pt_br: Q&uebra automatica de mensagens de subimissão para (caracteres):

source: Adds a new status variable to the status label
pt_br: Adicionar uma nova variável de situação ao rótulo de situação

source: Newly created files will have to be manually included in commit
pt_br: Novos arquivos deverão ser incluídos manualmente ao submeter

source: Commit messages longer than the specified number of characters will be wrapped to multiple lines
pt_br: Mensagens grandes de submissão maiores que o número de caracteres especificados serão quebrados em múltiplas linhas

source: Definition of the status label shown beside versioned files
pt_br: Definição do rótulo de situação exibido dentro dos arquivos versionados

source: CVS Client Library
pt_br: Biblioteca para cliente do CVS

source: A CVS client library, that substitutes the client side of the native CVS executable.
pt_br: Uma biblioteca cliente CVS, a qual substitui o lado cliente de um cliente executável de CVS.

source: The CVS Client Library module implements the client side of CVS server connection.
pt_br: O módulo biblioteca cliente CVS implementa o lado cliente da conexão do servidor CVS.

source: Local connections are not supported.
pt_br: Conexões locais não são suportadas.

source: Version Control
pt_br: Controle de versão

source: No files have been specified for addition.
pt_br: Nenhum arquivo a ser adicionado foi informado.

source: Aborted during request processing.
pt_br: Abortado durante o processo de requisição.

source: Aborted during connecting to the server.
pt_br: Abortado durante conexão com o servidor.

source: The file {0} that is used for commit log message doesn't exist.
pt_br: O arquivo {0} que é utilizado para mensagens de log de submissão não existe.

source: Error while reading file {0} that is used for commit log message.
pt_br: Erro lendo arquivo {0} o qual é utilizado como arquivo de log de mensagens para a submissão.

source: Server closed connection.
pt_br: O servidor fechou a conexão.

source: Check the output log for details.
pt_br: Verifique a saída do log para detalhes.

source: The message may not be null nor empty!
pt_br: A mensagem não pode ser nula nem vazia!

source: The module may not be null nor empty!
pt_br: O módulo não pode ser nulo ou vazio!

source: <no module>
pt_br: <sem módulo>

source: The release tag may not be null nor empty!
pt_br: A marcação de liberação não pode ser nula ou vazia!

source: <no release tag>
pt_br: <sem marcação de liberação>

source: The vendor tag may not be null nor empty!
pt_br: O fornecedor não pode ser nulo ou vazio!

source: <no vendor tag>
pt_br: <sem marcação de fornecedor>

source: No files have been specified for removal.
pt_br: Não foram especificados arquivos para exclusão.

source: Cannot delete file {0}.
pt_br: Não é possível excluir arquivo {0}.

source: the .cvswrappers file in the home directory on the client
pt_br: o arquivo .cvswrappers no diretório home do cliente

source: the environment variable CVSWRAPPERS
pt_br: variável de ambiente CVSWRAPPERS

source: An error occurred while processing wrapper information from {0}.
pt_br: Um erro ocorreu durante o processamento das informações do empacotador a partir de {0}.

source: Unknown host {0}.
pt_br: Máquina {0} desconhecida.

source: I/O error while connecting to host {0}.
pt_br: Erro de E/S enquanto conectando à máquina {0}.

source: No route to host {0}.
pt_br: Sem rota para a máquina {0}.

source: Cannot connect to host {0}:{1}.
pt_br: Impossível conectar à máquina {0}:{1}.

source: General error during authentication with host.
pt_br: Erro geral durante a autenticação com a máquina.

source: Host name must not be null.
pt_br: O nome da máquina não pode ser nulo.

source: Authentication failed.
pt_br: Autenticação falhou.

source: Response from server was: "{0}".
pt_br: A resposta do servidor foi: "{0}".

source: Cannot verify server connection.
pt_br: Impossível verificar a resposta do servidor.

source: Cannot open server connection.
pt_br: Impossível abrir conexão com o servidor.

source: Wrong Password.
pt_br: Senha incorreta.

source: <html>Received unknown response from server:<p><tt>{0}</tt><p>Check your setup please:<ul><li>Are you connecting to supported CVS server?<li>Is not misconfigured <tt>CVS_SERVER{1}</tt> environment variable?<li>For <tt>:local:</tt> repositories:<br>What <tt>cvs</tt> binary is executed?<br>It is defined by <tt>CVS_EXE{2}</tt> environment variable.</ul>
pt_br: <html>Resposta desconhecida recebida do servidor:<p><tt>{0}</tt><p>Verifique sua instalação:<ul><li>Você está conectado ao servidor CVS suportado?<li>A variável de ambiente <tt>CVS_SERVER{1}</tt> não está mal configurada?<li>Para repositórios <tt>:local:</tt>:<br>Qual binário <tt>cvs</tt> é executado?<br>É definido pela variável de ambiente <tt>CVS_EXE{2}</tt>.</ul>

source: Usage: cvs [global options] command [command-options-and-arguments]
pt_br: Utlização: cvs [opções globais] comando [argumento-e-opções-de-comando]

source: specify {0} for a list of global options
pt_br: informe {0} para uma lista de opções globais

source: specify {1} for a list of possible commands
pt_br: informe {1} para uma lista de comandos possíveis

source: specify {2} for a list of command synonyms
pt_br: especifique {2} para uma lista de sinônimos de comandos

source: CVS global options (specified before the command name) are:
pt_br: Opções globais do CVS (especificado antes do nome do comando) são:

source: -H Displays usage information for command.
pt_br: -H Exibe informação de utilização do comando.

source: -q Cause CVS to be somewhat quiet.
pt_br: -q Torna o CVS mais silencioso.

source: -Q Cause CVS to be really quiet.
pt_br: -Q Torna o CVS realmente silencioso.

source: -r Make checked-out files read-only.
pt_br: -r Torna arquivos obtidos como somente-leitura.

source: -w Make checked-out files read-write (default).
pt_br: -w Torna arquivos obtidos como leitura-escrita (padrão).

source: -l Turn history logging off.
pt_br: -l Desliga o histórico.

source: -n Do not execute anything that will change the disk.
pt_br: -n Não executa nada que altere o disco.

source: -t Show trace of program execution -- try with -n.
pt_br: -t Exibe a trilha de execução do programa -- tente com -n.

source: -v Display JavaCVS version.
pt_br: -v Exibe a versão do JavaCVS.

source: -T tmpdir Use 'tmpdir' for temporary files.
pt_br: -T tmpdir Utiliza 'tmpdir' para arquivos temporários.

source: -e editor Use 'editor' for editing log information.
pt_br: -e editor Utiliza 'editor' para edição de informação do log.

source: -d CVS_root Overrides $CVSROOT as the root of the CVS tree.
pt_br: -d CVS_root Sobrescreve $CVSROOT como a raiz da árvore CVS.

source: -f Do not use the ~/.cvsrc file.
pt_br: -f Não utiliza o arquivo ~/.cvsrc.

source: -z # Use compression level '#' for net traffic.
pt_br: -z # Utiliza compressão de nível '#' para tráfego na rede.

source: -s VAR=VAL Set CVS user variable.
pt_br: -s VAR=VAL Define variável do usuário CVS.

source: CVS commands are:
pt_br: Os comandos CVS são:

source: CVS command synonyms are:
pt_br: Os sinônimos de comandos CVS são:

source: Unknown command: ''{0}''
pt_br: Comando desconhecido: ''{0}''

source: add [-k rcs-kflag] [-m message] files...
pt_br: add [-k rcs-kflag] [-m mensagem] arquivos...

source: Add a new file/directory to the repository.
pt_br: Adicona um novo arquivo/diretório ao repositório.

source: Usage: {0}
pt_br: Utilização: {0}

source: -k Use "rcs-kflag" to add the file with the specified kflag.
pt_br: -k Utilize "rcs-kflag" para adicionar o arquivo com o kflag especificado.

source: -m Use "message" for the creation log.
pt_br: -m Utilize "mensagem" para log de criação.

source: annotate [-lRf] [-r rev|-D date] [files...]
pt_br: annotate [-lRf] [-r rev|-D data] [arquivos...]

source: Show the last revision where each source line was modified.
pt_br: Exibe a última revisão onde cada linha foi modificada.

source: -l Local directory only, no recursion.
pt_br: -l Somente diretório local, não é recursivo.

source: -R Process directories recursively.
pt_br: -R Processa os diretórios recursivamente.

source: -f Use head revision if tag/date not found.
pt_br: -f Utiliza a revisão mais atual caso a marcação/data não for encontrada.

source: -r rev Annotate file as of specified revision/tag.
pt_br: -r rev Anota o arquivo com a revisão/marcação especificada.

source: -D date Annotate file as of specified date.
pt_br: -D data Anota o arquivo com a data especificada.

source: checkout [-ANPRcflnps] [-r rev | -D date] [-d dir] [-j rev1] [-j rev2] [-k kopt] modules...
pt_br: checkout [-ANPRcflnps] [-r rev | -D data] [-d dir] [-j rev1] [-j rev2] [-k kopt] módulos...

source: Check out the sources from repository to local working directory.
pt_br: Carrega os códigos-fonte a partir do repositório remoto para o diretório de trabalho local.

source: -A Reset any sticky tags/date/kopts.
pt_br: -A Redefine qualquer marcação/data/kopts fixo.

source: -N Don't shorten module paths if -d specified.
pt_br: -N Não encurta caminho dos módulos caso -d for especificado.

source: -P Prune empty directories.
pt_br: -P Remove diretórios vazios.

source: -c "cat" the module database.
pt_br: -c "cat" o banco de dados de módulos.

source: -f Force a head revision match if tag/date not found.
pt_br: -f Força uma revisão de cabeçalho que combine se marcação/data não encontrada.

source: -l Local directory only, not recursive
pt_br: -l Diretório local apenas, não recursivo

source: -n Do not run module program (if any).
pt_br: -n Não executar programa do módulo (se existir).

source: -p Check out files to standard output (avoids stickiness).
pt_br: -p Carrega os arquivos para a saída padrão (evita persistência).

source: -s Like -c, but include module status.
pt_br: -s Igual -c, mas inclui o estado do módulo.

source: -r rev Check out revision or tag.
pt_br: -r rev Carrega a revisão ou marcação.

source: (implies -P) (is sticky)
pt_br: (implica -P) (é fixo)

source: -D date Check out revisions as of date.
pt_br: -D data Obtem revisões por data.

source: -d dir Check out into dir instead of module name.
pt_br: -d dir Obtem em 'dir' ao invés do nome do módulo.

source: -k kopt Use RCS kopt -k option on checkout.
pt_br: -k kopt Utiliza a opção RCS kopt -k durante carregamento.

source: -j rev Merge in changes made between current revision and rev.
pt_br: -j rev Mescla as alterações feitas entre a revisão corrente e rev.

source: commit [-nRlf] [-m msg | -F logfile] [-r rev] files...
pt_br: commit [-nRlf] [-m msg | -F arquivolog] [-r rev] arquivos...

source: Check files into the repository.
pt_br: Submete os arquivos ao repositório.

source: -n Do not run the module program (if any).
pt_br: -n Não executar programa do módulo (se existir).

source: -l Local directory only (not recursive).
pt_br: -l Diretório local apenas, não recursivo

source: -f Force the file to be committed; disables recursion.
pt_br: -f Força o arquivo ser submetido; desabilita recursividade.

source: -F file Read the log message from file.
pt_br: -F arquivo Obtem a mensagem de log a partir do arquivo.

source: -m msg Log message.
pt_br: -m msg Mensagem de log.

source: -r rev Commit to this branch or trunk revision.
pt_br: -r rev Submete para este branch ou revisão do trunk.

source: The message was not specified.
pt_br: A mensagem não foi especificada.

source: Please use -m or -F options.
pt_br: Utilize as opções -m ou -F.

source: diff [-lNR] [rcsdiff-options] [[-r rev1 | -D date1] [-r rev2 | -D date2]] [files...]
pt_br: diff [-lNR] [rcsdiff-opções] [[-r rev1 | -D data1] [-r rev2 | -D data2]] [arquivos...]

source: Show differences between local file and a revision, or between two revisions.
pt_br: Exibe as diferenças entre arquivos locais e uma determinada revisão, ou entre duas revisões.

source: -D d1 Diff revision for date against working file.
pt_br: -D d1 Diff da revisão para a data informada contra o arquivo de trabalho local.

source: -D d2 Diff rev1/date1 against date2.
pt_br: -D d2 Diff da rev1/data1 contra data2.

source: -N include diffs for added and removed files.
pt_br: -N inclui diffs para arquivos adicionados e removidos.

source: -r rev1 Diff revision for rev1 against working file.
pt_br: -r rev1 Compara revisão para rev1 contra arquivo atual.

source: -r rev2 Diff rev1/date1 against rev2.
pt_br: -r rev2 Diff de rev1/date1 contra rev2.

source: --ifdef=arg Output diffs in ifdef format.
pt_br: --ifdef=arg Saída diffs no formato ifdef.

source: (consult the documentation for the CVS server diff program for rcsdiff-options.
pt_br: (consultar a documentação para programa diff do servidor CVS por rcsdiff-options.

source: The most popular is -c for context diffs but there are many more).
pt_br: O mais popular é -c para diffs de contexto mas existem muito mais).

source: export [-NPRfln] [-r rev | -D date] [-d dir] [-k kopt] module...
pt_br: export [-NPRfln] [-r rev | -D data] [-d dir] [-k kopt] módulo...

source: Export sources from CVS, without administrative files.
pt_br: Exporta fontes do CVS, sem arquivos administrativos.

source: -l Local directory only, not recursive.
pt_br: -l Diretório local apenas, não recursivo

source: -R Process directories recursively (default).
pt_br: -R Processa diretórios recursivamente (padrão).

source: -r rev Export revision or tag.
pt_br: -r rev Exporta revisão ou marcação.

source: -D date Export revisions as of date.
pt_br: -D data Exporta revisões como data.

source: -d dir Export into dir instead of module name.
pt_br: -d dir Exporta no dir ao invés do nome do módulo.

source: must specify a tag or date
pt_br: deve especificar uma marcação ou data

source: import [-d] [-k subst] [-I ign] [-m msg] [-b branch] [-W spec] repository vendor-tag release-tags...
pt_br: import [-d] [-k subst] [-I ign] [-m msg] [-b branch] [-W spec] repositório vendor-tag release-tags...

source: Import sources into CVS repository, using a vendor branch.
pt_br: Importa fontes no repositório CVS, utilizando um branch do vendedor.

source: -d Use the file's modification time as the time of import.
pt_br: -d Utiliza a hora de modificação do arquivo como hora da importação.

source: -k sub Set default RCS keyword substitution mode.
pt_br: -k sub Define modo de substituição da palavra-chave RCS padrão.

source: -I ign More files to ignore (!
pt_br: -I ign Mais arquivos à ignorar (!

source: to reset).
pt_br: à redefinir).

source: -b bra Vendor branch id.
pt_br: -b bra Id do branch do vendedor.

source: -W spec Wrappers specification line.
pt_br: -W spec Linha de especificação de Wrappers.

source: locbundlecheck -i <localization> [<other annotate switches>] [files...]
pt_br: locbundlecheck -i <localização> [<outras opções de anotação>] [arquivos...]

source: Detect what bundle keys need to be updated in localized resource bundles.
pt_br: Detectar que chaves do pacote precisam ser atualizadas em pacotes de recursos localizados.
